[
    {
        "userImage": "https://randomuser.me/api/portraits/men/1.jpg",
        "userName": "Harold Varner",
        "productName": "NAILING PNEUMATIC",
        "rating": "4.8 ",
        "comment": "At first I was impressed with the feel & looks...seemed high quality. Then I start using & it misfires like 4 blanks to each staple. I'm using Arrow brand staples too. The misfires started punching holes in my new cover for my Seadoo. It seems like the staples aren't into the trigger mechanism & I read the crappy directions 4x. There is no noticeable spring mechanism from what I could see. Sending it back. "
    },
    {
        "userImage": "https://randomuser.me/api/portraits/men/32.jpg",
        "userName": "Peggy J. Colbert",
        "productName": "POWERED PINNER",
        "rating": "4.9",
        "comment": "I've used a few different pinners over the years and this one performs pretty well. I've had trouble using it with melamine cabinets, the pins don't seem to set correctly, or won't even penetrate the surface of the hardened surface. At the same time, I have used it numerous times on hardwoods like oak and cherry with no problems. Decent product for the price.  "
    },
    {
        "userImage": "https://randomuser.me/api/portraits/men/40.jpg",
        "userName": "Ngô Thanh ",
        "productName": "NARROW CROWN",
        "rating": "4.5 ",
        "comment": "If you have a compressor already, especially a small one, there is no reason not to go with this over a manual gun. Small, light, maneuverable, powerful, and easy to use. It costs barely more than a manual gun, too. The pneumatic power lets you focus on positioning the staple.  "
    },
    {
        "userImage": "https://randomuser.me/api/portraits/men/86.jpg",
        "userName": "Willie L. Kirby",
        "productName": "BOSTITCH COIL ",
        "rating": "4.8",
        "comment": "Lots of power, easy to use. I wanted the safer trigger configuration (no bump firing) so I had to replace the trigger with the gray one that was included. Weirdly, the instructions said that the gray one came from the factory and that you need to replace the trigger to get the high-volume configuration. "
    },
    {
        "userImage": "https://randomuser.me/api/portraits/men/61.jpg",
        "userName": "Bethany Towner",
        "productName": "SENCO STAPLING",
        "rating": "4.6 ",
        "comment": "I replace the flooring in my 6 by 10 enclosed trailer and was in need of a staple gun to replace the trim it worked really good far better than I was expecting, my gosh they better than I even imagined I have every intention of seeing what else they offer in finish nailer for some of my other projects. "
    }
]